#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
github_repository_file.svc_template_rust_sdd: Refreshing state... [id=svc-template-rust/docs/sdd.md]
module.repository["cla-bot"].github_repository.repository: Refreshing state... [id=cla-bot]
github_repository_file.svc_template_python_sdd: Refreshing state... [id=svc-template-python/docs/sdd.md]
module.tf_repository["github"].data.github_team.owner: Reading...
module.repository["cla-bot"].data.github_team.owner: Reading...
github_repository_file.lib_template_rust_sdd: Refreshing state... [id=template-rust-lib/docs/sdd.md]
module.tf_repository["onboarding"].github_repository.repository: Refreshing state... [id=tf-onboarding]
github_repository.svc_template_rust: Refreshing state... [id=svc-template-rust]
github_repository.svc_template_typescript: Refreshing state... [id=svc-template-typescript]
github_repository.lib_template_rust: Refreshing state... [id=template-rust-lib]
github_repository_file.svc_template_typescript_sdd: Refreshing state... [id=svc-template-typescript/docs/sdd.md]
github_repository.svc_template_python: Refreshing state... [id=svc-template-python]
module.svc_repository["storage"].data.github_team.owner: Reading...
module.repository["clabot-config"].github_repository.repository: Refreshing state... [id=clabot-config]
module.tf_repository["github"].data.github_team.owner: Read complete after 2s [id=6311795]
module.repository["tools"].github_repository.repository: Refreshing state... [id=tools]
module.repository["website"].github_repository.repository: Refreshing state... [id=website]
module.tf_repository["onboarding"].data.github_team.owner: Reading...
module.tf_repository["github"].github_repository.repository: Refreshing state... [id=tf-github]
module.repository["clabot-config"].data.github_team.owner: Reading...
module.repository["tools"].data.github_team.owner: Reading...
module.repository["website"].data.github_team.owner: Reading...
github_team_repository.svc_template_typescript_maintainer: Refreshing state... [id=6311795:svc-template-typescript]
module.repository["cla-bot"].data.github_team.owner: Read complete after 4s [id=6029505]
github_team_repository.svc_template_rust_maintainer: Refreshing state... [id=6311795:svc-template-rust]
github_team_repository.svc_template_python_maintainer: Refreshing state... [id=6311795:svc-template-python]
module.repository["website"].github_branch_default.default: Refreshing state... [id=website]
module.repository["cla-bot"].github_branch_default.default: Refreshing state... [id=cla-bot]
module.repository["clabot-config"].github_branch_default.default: Refreshing state... [id=clabot-config]
module.svc_repository["storage"].data.github_team.owner: Read complete after 4s [id=6311795]
module.repository["tools"].github_branch_default.default: Refreshing state... [id=tools]
module.repository["website"].github_branch.branch["staging"]: Refreshing state... [id=website:staging]
module.svc_repository["storage"].github_repository.repository: Refreshing state... [id=svc-storage]
github_team_repository.lib_template_rust_maintainer: Refreshing state... [id=6311795:template-rust-lib]
module.tf_repository["onboarding"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087608]
module.tf_repository["github"].github_branch_default.default: Refreshing state... [id=tf-github]
module.tf_repository["github"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087606]
module.tf_repository["onboarding"].github_branch_default.default: Refreshing state... [id=tf-onboarding]
module.tf_repository["onboarding"].data.github_team.owner: Read complete after 3s [id=6029505]
module.tf_repository["onboarding"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-onboarding]
module.tf_repository["github"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:tf-github]
module.tf_repository["github"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:tf-github]
module.repository["clabot-config"].data.github_team.owner: Read complete after 4s [id=6029505]
module.svc_repository["storage"].github_team_repository.maintainer["services"]: Refreshing state... [id=6311795:svc-storage]
module.svc_repository["storage"].github_branch_default.default: Refreshing state... [id=svc-storage]
module.repository["tools"].data.github_team.owner: Read complete after 4s [id=6203057]
module.svc_repository["storage"].github_branch.branch["develop"]: Refreshing state... [id=svc-storage:develop]
module.repository["website"].data.github_team.owner: Read complete after 4s [id=5490296]
module.svc_repository["storage"].github_repository_webhook.map["discord"]: Refreshing state... [id=372087597]
module.repository["clabot-config"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:clabot-config]
module.repository["tools"].github_team_repository.maintainer["drone-engineering"]: Refreshing state... [id=6203057:tools]
module.repository["website"].github_team_repository.maintainer["webdevelopers"]: Refreshing state... [id=5490296:website]
module.repository["cla-bot"].github_team_repository.maintainer["devops"]: Refreshing state... [id=6029505:cla-bot]
module.repository["cla-bot"].github_repository_file.CODEOWNERS: Refreshing state... [id=cla-bot/.github/CODEOWNERS]
module.repository["clabot-config"].github_repository_file.CODEOWNERS: Refreshing state... [id=clabot-config/.github/CODEOWNERS]
module.repository["website"].github_repository_file.CODEOWNERS: Refreshing state... [id=website/.github/CODEOWNERS]
module.repository["tools"].github_repository_file.CODEOWNERS: Refreshing state... [id=tools/.github/CODEOWNERS]
module.tf_repository["onboarding"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-onboarding/.github/CODEOWNERS]
module.tf_repository["github"].github_repository_file.CODEOWNERS: Refreshing state... [id=tf-github/.github/CODEOWNERS]
module.svc_repository["storage"].github_repository_file.CODEOWNERS: Refreshing state... [id=svc-storage/.github/CODEOWNERS]
module.repository["cla-bot"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHTAbhc4BmmRb]
module.repository["tools"].github_branch_protection.all["tools"]: Refreshing state... [id=BPR_kwDOHn-Jf84BpnEA]
module.repository["cla-bot"].github_branch_protection.all["cla-bot"]: Refreshing state... [id=BPR_kwDOHTAbhc4BpnEE]
module.repository["tools"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Jf84BmmRe]
module.repository["website"].github_branch_protection.all["website"]: Refreshing state... [id=BPR_kwDOGdyvzM4BpnEJ]
module.repository["website"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcN]
module.repository["website"].github_branch_protection.protection["staging"]: Refreshing state... [id=BPR_kwDOGdyvzM4BiRcL]
module.tf_repository["github"].github_branch_protection.all["tf-github"]: Refreshing state... [id=BPR_kwDOG6VIns4BpnEQ]
module.tf_repository["github"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOG6VIns4BpLGe]
module.svc_repository["storage"].github_branch_protection.protection["develop"]: Refreshing state... [id=BPR_kwDOHn-Ji84BpLXK]
module.svc_repository["storage"].github_branch_protection.protection["main"]: Refreshing state... [id=BPR_kwDOHn-Ji84BmmRg]
module.svc_repository["storage"].github_branch_protection.all["svc-storage"]: Refreshing state... [id=BPR_kwDOHn-Ji84BpnDy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repository["website"].github_branch.branch["staging"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"d48490aa27dbcfcf89d0834d3647d4f1ab8c90f4dec63f6e7ea72600aa8bf882\"" -> "W/\"193ccd10f21715bfc77cbb40a66ebd1b187c1ce9a4a868133e9e7d7787987f88\""
        id            = "website:staging"
        # (5 unchanged attributes hidden)
    }

  # module.svc_repository["storage"].github_branch.branch["develop"] has changed
  ~ resource "github_branch" "branch" {
      ~ etag          = "W/\"8203f652e5dd71b56d7f846a66517ad18dcfd5fe9d1f26cf21ff049afd3148c4\"" -> "W/\"f5820de97dbb382f9679a5bc8857444c3f9582628cc10b0b43b2dc7de6f80085\""
        id            = "svc-storage:develop"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_repository_file.lib_template_rust_sdd will be destroyed
  # (because github_repository_file.lib_template_rust_sdd is not in configuration)
  - resource "github_repository_file" "lib_template_rust_sdd" {
      - branch              = "main" -> null
      - commit_author       = "Arrow automation" -> null
      - commit_email        = "automation@arrowair.com" -> null
      - commit_message      = "Provisioned by Terraform" -> null
      - commit_sha          = "6fbf8e7cb87442adf7edb5622abf00eb50591e0f" -> null
      - content             = <<-EOT
            ![Arrow Banner](https://github.com/Arrow-air/.github/raw/main/profile/assets/arrow_v2_twitter-banner_neu.png)
            
            # <LIBRARY_NAME> - Software Design Document (SDD)
            
            ## Overview
            
            This document details the software implementation of FIXME library.
            
            This library contains the implementation and testing for FIXME
            
            Attribute | Description
            --- | ---
            Status | Draft
            
            ## Related Documents
            
            Document | Description
            --- | ---
            [Concept of Operations (CONOPS) (FIXME)](./FIXME) | Overview of the scope and duties of this module.
            [Requirements & User Stories (FIXME)](./FIXME) | Requirements and user stories for this module.
            
            ## Module Attributes
            
            Attribute | Applies | Explanation
            --- | --- | ---
            Safety Critical | Y | 
            Realtime | Y |
            
            ## Global Variables
            
            **Statically Allocated Queues**
            
            FIXME
            
            **State Machine Status**
            
            FIXME
            
            ## Interfaces
            
            For a refresher of the processes in the Arrow backend, please see the [top level README.md](../README.md).
            
            ```mermaid
            graph TD
                subgraph Client
                    client[Client App]
                end
            
                subgraph microservice X
                    api[API Gateway]
                    logic{{Logic}}
                    lib((library FIXME))
                end
            
                client --> api
                api --> logic
                logic --- lib
            ```
            
            FIXME Explanation of the above graph
            
            ## Tests
            
            ### Unit Tests
            
            Rust unit testing framework. FIXME
            
            ### Integration Tests
            
            Rust integration testing framework. FIXME
        EOT -> null
      - file                = "docs/sdd.md" -> null
      - id                  = "template-rust-lib/docs/sdd.md" -> null
      - overwrite_on_create = false -> null
      - repository          = "template-rust-lib" -> null
      - sha                 = "0ed3016962e87eb0bcf259549b11b33d0eda9ea5" -> null
    }

  # github_repository_file.svc_template_python_sdd will be destroyed
  # (because github_repository_file.svc_template_python_sdd is not in configuration)
  - resource "github_repository_file" "svc_template_python_sdd" {
      - branch              = "main" -> null
      - commit_author       = "Arrow automation" -> null
      - commit_email        = "automation@arrowair.com" -> null
      - commit_message      = "Provisioned by Terraform" -> null
      - commit_sha          = "13562bcb3bce610de650cb2f46c7dfb34511965f" -> null
      - content             = <<-EOT
            ![Arrow Banner](https://github.com/Arrow-air/.github/raw/main/profile/assets/arrow_v2_twitter-banner_neu.png)
            
            # \<MODULE NAME\> - Software Design Document (SDD)
            
            ## Overview
            
            This document details the software implementation of FIXME.
            
            This process is responsible for FIXME
            
            Attribute | Description
            --- | ---
            Status | Draft
            
            ## Related Documents
            
            Document | Description
            --- | ---
            [Concept of Operations (CONOPS) (FIXME)](./FIXME) | Overview of the scope and duties of this module.
            [Requirements & User Stories (FIXME)](./FIXME) | Requirements and user stories for this module.
            
            ## Location
            
            FIXME
            
            ## Module Attributes
            
            Attribute | Applies | Explanation
            --- | --- | ---
            Safety Critical | ? | 
            Realtime | ? |
            
            ## Global Variables
            
            **Statically Allocated Queues**
            
            FIXME
            
            ## Logic 
            
            ### Initialization
            
            FIXME 
            
            ### Control Loop
            
            FIXME
            
            ### Cleanup
            
            FIXME
            
            ## Interfaces
            
            For a refresher of the processes in the Arrow backend, please see the [top level README.md](../README.md).
            
            ```mermaid
            graph LR
                subgraph Vehicle Domain
                    air((Aircraft))
                end
            
                subgraph Client Domain
                    app(App X)
                end
            
                subgraph Server Domain
                    module[Module A]
                end
            ```
            
            FIXME description of the graph.
            
            ## Tests
            
            FIXME
            
            ### Unit Tests
            
            FIXME
        EOT -> null
      - file                = "docs/sdd.md" -> null
      - id                  = "svc-template-python/docs/sdd.md" -> null
      - overwrite_on_create = false -> null
      - repository          = "svc-template-python" -> null
      - sha                 = "641ea8c40acdd620e7e1af92ee29c81a9974fd4a" -> null
    }

  # github_repository_file.svc_template_rust_sdd will be destroyed
  # (because github_repository_file.svc_template_rust_sdd is not in configuration)
  - resource "github_repository_file" "svc_template_rust_sdd" {
      - branch              = "main" -> null
      - commit_author       = "Arrow automation" -> null
      - commit_email        = "automation@arrowair.com" -> null
      - commit_message      = "Provisioned by Terraform" -> null
      - commit_sha          = "0735447e4a4294946038c83469697e76bb2b86af" -> null
      - content             = <<-EOT
            ![Arrow Banner](https://github.com/Arrow-air/.github/raw/main/profile/assets/arrow_v2_twitter-banner_neu.png)
            
            # \<MODULE NAME\> - Software Design Document (SDD)
            
            ## Overview
            
            This document details the software implementation of FIXME.
            
            This process is responsible for FIXME
            
            Attribute | Description
            --- | ---
            Status | Draft
            
            ## Related Documents
            
            Document | Description
            --- | ---
            [Concept of Operations (CONOPS) (FIXME)](./FIXME) | Overview of the scope and duties of this module.
            [Requirements & User Stories (FIXME)](./FIXME) | Requirements and user stories for this module.
            
            ## Location
            
            FIXME
            
            ## Module Attributes
            
            Attribute | Applies | Explanation
            --- | --- | ---
            Safety Critical | ? | 
            Realtime | ? |
            
            ## Global Variables
            
            **Statically Allocated Queues**
            
            FIXME
            
            ## Logic 
            
            ### Initialization
            
            FIXME 
            
            ### Control Loop
            
            FIXME
            
            ### Cleanup
            
            FIXME
            
            ## Interfaces
            
            For a refresher of the processes in the Arrow backend, please see the [top level README.md](../README.md).
            
            ```mermaid
            graph LR
                subgraph Vehicle Domain
                    air((Aircraft))
                end
            
                subgraph Client Domain
                    app(App X)
                end
            
                subgraph Server Domain
                    module[Module A]
                end
            ```
            
            FIXME description of the graph.
            
            ## Tests
            
            FIXME
            
            ### Unit Tests
            
            FIXME
        EOT -> null
      - file                = "docs/sdd.md" -> null
      - id                  = "svc-template-rust/docs/sdd.md" -> null
      - overwrite_on_create = false -> null
      - repository          = "svc-template-rust" -> null
      - sha                 = "641ea8c40acdd620e7e1af92ee29c81a9974fd4a" -> null
    }

  # github_repository_file.svc_template_typescript_sdd will be destroyed
  # (because github_repository_file.svc_template_typescript_sdd is not in configuration)
  - resource "github_repository_file" "svc_template_typescript_sdd" {
      - branch              = "main" -> null
      - commit_author       = "Arrow automation" -> null
      - commit_email        = "automation@arrowair.com" -> null
      - commit_message      = "Provisioned by Terraform" -> null
      - commit_sha          = "32af589c22d9e93ad9d12f77d642c6f27c355d60" -> null
      - content             = <<-EOT
            ![Arrow Banner](https://github.com/Arrow-air/.github/raw/main/profile/assets/arrow_v2_twitter-banner_neu.png)
            
            # \<MODULE NAME\> - Software Design Document (SDD)
            
            ## Overview
            
            This document details the software implementation of FIXME.
            
            This process is responsible for FIXME
            
            Attribute | Description
            --- | ---
            Status | Draft
            
            ## Related Documents
            
            Document | Description
            --- | ---
            [Concept of Operations (CONOPS) (FIXME)](./FIXME) | Overview of the scope and duties of this module.
            [Requirements & User Stories (FIXME)](./FIXME) | Requirements and user stories for this module.
            
            ## Location
            
            FIXME
            
            ## Module Attributes
            
            Attribute | Applies | Explanation
            --- | --- | ---
            Safety Critical | ? | 
            Realtime | ? |
            
            ## Global Variables
            
            **Statically Allocated Queues**
            
            FIXME
            
            ## Logic 
            
            ### Initialization
            
            FIXME 
            
            ### Control Loop
            
            FIXME
            
            ### Cleanup
            
            FIXME
            
            ## Interfaces
            
            For a refresher of the processes in the Arrow backend, please see the [top level README.md](../README.md).
            
            ```mermaid
            graph LR
                subgraph Vehicle Domain
                    air((Aircraft))
                end
            
                subgraph Client Domain
                    app(App X)
                end
            
                subgraph Server Domain
                    module[Module A]
                end
            ```
            
            FIXME description of the graph.
            
            ## Tests
            
            FIXME
            
            ### Unit Tests
            
            FIXME
        EOT -> null
      - file                = "docs/sdd.md" -> null
      - id                  = "svc-template-typescript/docs/sdd.md" -> null
      - overwrite_on_create = false -> null
      - repository          = "svc-template-typescript" -> null
      - sha                 = "641ea8c40acdd620e7e1af92ee29c81a9974fd4a" -> null
    }

  # module.repository["cla-bot"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHTAbhc4BmmRb"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["tools"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Jf84BmmRe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcN"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.repository["website"].github_branch_protection.protection["staging"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOGdyvzM4BiRcL"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.svc_repository["storage"].github_branch_protection.protection["develop"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Ji84BpLXK"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.svc_repository["storage"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOHn-Ji84BmmRg"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.svc_repository["storage"].github_repository_file.files[".cargo-husky/hooks/README.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT EDIT! This file was provisioned by Terraform
            
            These hooks will be copied to `.git/hooks/` when `cargo test` is run.
            
            :exclamation: If editing these hooks, you will need to delete the `target/`
            directory and re-run `cargo test`.
        EOT
      + file                = ".cargo-husky/hooks/README.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.svc_repository["storage"].github_repository_file.files[".cargo-husky/hooks/pre-commit"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            ##
            #
            # This hook was set by cargo-husky v1.5.0: https://github.com/rhysd/cargo-husky#readme
            
            # Style templates for console output.
            GREEN=$(tput setaf 2)
            YELLOW=$(tput setaf 3)
            BOLD=$(tput bold)
            NC=$'\e[0m'
            
            echo "${BOLD}${YELLOW}Running the pre-commit hook...${NC}${NC}\n" # should be visible in the console when doing a git commit
            
            set -e
            
            # RUST
            echo "${YELLOW}Running cargo tests...${NC}"
            cargo test --all
            echo "${YELLOW}Linting Rust codes through clippy...${NC}"
            cargo clippy --all -- -D warnings
            echo "${YELLOW}Running and checking Rust codes formats...\n${NC}"
            cargo fmt --all -- --check
            
            # PYTHON 3
            echo "${YELLOW}Formatting and checking Python files with Google style...\n${NC}"
            yapf -r -i -vv . style google
            echo "${YELLOW}Formatting and checking Python files with flake8 style...\n${NC}"
            flake8 .
            
            
            # Style Check
            echo "${YELLOW}Checking if the codebase is compliant with the .editorconfig file...\n${NC}"
            ec
            
            # Finish
            echo "${BOLD}${GREEN}🍺 You are good to go!\n${NC}${NC}"
        EOT
      + file                = ".cargo-husky/hooks/pre-commit"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.svc_repository["storage"].github_repository_file.files[".cargo-husky/hooks/pre-push"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #!/bin/sh
            #
            ### DO NOT EDIT!
            # This file was provisioned by Terraform
            #
            # Do nothing
        EOT
      + file                = ".cargo-husky/hooks/pre-push"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.svc_repository["storage"].github_repository_file.files[".cargo/config.toml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # DO NOT EDIT
            # This file was provisioned by Terraform
            
            # https://doc.rust-lang.org/cargo/reference/config.html
            
            [build]
            rustflags = [
                "-Wmissing_docs",
                "-Wmissing_debug_implementations",
                "-Wmissing_copy_implementations",
                "-Wtrivial_casts",
                "-Wtrivial_numeric_casts",
                "-Wunsafe_code",
                "-Wunstable_features",
                "-Wunused_import_braces",
                "-Wunused_qualifications"
                ]
        EOT
      + file                = ".cargo/config.toml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.svc_repository["storage"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [*.md]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.yml]
            indent_size = 2
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.svc_repository["storage"].github_repository_file.files[".github/workflows/editorconfig_check.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            name: EditorConfig Check
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: EditorConfig-Action
                  uses: editorconfig-checker/action-editorconfig-checker@main
                - run: editorconfig-checker
        EOT
      + file                = ".github/workflows/editorconfig_check.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.svc_repository["storage"].github_repository_file.files[".github/workflows/python_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Python Checks
            
            # env:
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              formatting-check:
                name: Formatting Check
                runs-on: ubuntu-20.04
                steps:
                - uses: actions/checkout@v2
                - name: YAPF for proper formatting
                  run: |
                    python3 -m pip install -r requirements.txt
                    yapf -r -i -vv . style google
            
              flake8-lint:
                runs-on: ubuntu-20.04
                name: Lint
                steps:
                  - name: Check out source repository
                    uses: actions/checkout@v2
                  - name: Set up Python environment
                    uses: actions/setup-python@v2
                    with:
                      python-version: "3.10"
                  - name: flake8 Lint
                    uses: py-actions/flake8@v2
                    with:
                      # ignore: "F401"
                      exclude: "src/ignoreme.py"
                      max-line-length: "100"
                      path: "src"
                      plugins: "flake8-bugbear==22.1.11 flake8-black"
        EOT
      + file                = ".github/workflows/python_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.svc_repository["storage"].github_repository_file.files[".github/workflows/rust_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # Check file validity at: https://rhysd.github.io/actionlint/
            # https://github.com/actions/virtual-environments/blob/main/images/linux/Ubuntu2004-Readme.md
            
            on:
              push:
                branches:
                - main
              pull_request:
            
            name: Rust Checks
            
            env:
              RUST_VERSION: 1.62.0
              # 2022/07/12: Can't use env.VALUE in "runs-on" field yet
              # UBUNTU_VERSION: ubuntu-20.04
            
            jobs:
              check:
                name: Checks
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - uses: actions-rs/cargo@v1
                    with:
                      command: check
            
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-20.04
                env:
                    RUSTC_BOOTSTRAP: 1
                    CARGO_INCREMENTAL: 0
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
            
                  - name: Build
                    run: cargo build
            
                  - name: Test
                    run: cargo test
            
                  # Coming soon: grcov + push results to website or service (coveralls, etc.)
            
              fmt:
                name: Rustfmt
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add rustfmt
                  - uses: actions-rs/cargo@v1
                    with:
                      command: fmt
                      args: --all -- --check
            
              clippy:
                name: Clippy
                runs-on: ubuntu-20.04
                steps:
                  - uses: actions/checkout@v2
                  - uses: actions-rs/toolchain@v1
                    with:
                      profile: minimal
                      toolchain: ${{ env.RUST_VERSION }}
                      override: true
                  - run: rustup component add clippy
                  - uses: actions-rs/cargo@v1
                    with:
                      command: clippy
                      args: -- -D warnings
        EOT
      + file                = ".github/workflows/rust_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.svc_repository["storage"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_author       = "Arrow automation"
      + commit_email        = "automation@arrowair.com"
      + commit_message      = "Provisioned by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            
            # Generated by Cargo
            # will have compiled files and executables
            debug/
            target/
            
            # Remove Cargo.lock from gitignore if creating an executable, leave it for libraries
            # More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html
            # Cargo.lock
            
            # These are backup files generated by rustfmt
            **/*.rs.bk
            
            # MSVC Windows builds of rustc generate these, which store debugging information
            *.pdb
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.tf_repository["github"].github_branch_protection.protection["main"] will be updated in-place
  ~ resource "github_branch_protection" "protection" {
        id                              = "BPR_kwDOG6VIns4BpLGe"
        # (10 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 9 to add, 7 to change, 4 to destroy.

Changes to Outputs:
  ~ repositories = {
      ~ website       = {
          ~ branch         = {
              ~ staging = {
                  ~ etag          = "W/\"d48490aa27dbcfcf89d0834d3647d4f1ab8c90f4dec63f6e7ea72600aa8bf882\"" -> "W/\"193ccd10f21715bfc77cbb40a66ebd1b187c1ce9a4a868133e9e7d7787987f88\""
                    id            = "website:staging"
                    # (6 unchanged elements hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
        # (3 unchanged elements hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @ServiceDog, Action: `pull_request`*